<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","label":"test-apply apply_apply_error","backend":"1da19f298c0093f5b01f17efdf836e783ab1cd00efa7c881c3e9d83e84d7608a","plan_job_ref":"Job Test terraform-apply #777 at https://github.com/dflook/terraform-github-actions/actions/runs/17349369255","plan_out_hash":"8fcc7e70c5aa17cb7df7379bc5eebeb6eaca86225c8846f6a5ca1534a6e019dd","plan_hash":"e388353802f4be12ca764a6694f6178de34f1e1eaa383ac46e6ed4402c5a6bd8","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan for __test-apply apply_apply_error__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_s3_bucket.my_bucket will be created
+   resource "aws_s3_bucket" "my_bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "hello"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_region               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = "eu-west-2"
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Test terraform-apply #777](https://github.com/dflook/terraform-github-actions/actions/runs/17349369255)